// ------------------------------------------------------
// author：suxing
// date  ：2020/9/16 14:46
// usage ：全局 List 数组
// ------------------------------------------------------

/// 星座
const List<String> c_constellation = [
  "白羊座 (03月21日—04月20日)",
  "金牛座 (04月21日-05月20日)",
  "双子座 (05月21日-06月21日)",
  "巨蟹座 (06月22日-07月22日)",
  "狮子座 (07月23日-08月22日)",
  "处女座 (08月23日-09月22日)",
  "天秤座 (09月23日-10月22日)",
  "天蝎座 (10月23日-11月21日)",
  "射手座 (11月22日-12月21日)",
  "摩羯座 (12月22日-01月19日)",
  "水瓶座 (01月20日-02月18日)",
  "双鱼座 (02月19日-03月20日) "
];

/// 血型
const List<String> c_bloods = ["A型血", "B型血", "O型血", "AB型血"];

/// 古代时辰
const List<String> c_old_times = [
  "00:00 - 00:59 早子",
  "01:00 - 02:59 丑时",
  "03:00 - 04:59 寅时",
  "05:00 - 06:59 卯时",
  "07:00 - 08:59 辰时",
  "09:00 - 10:59 巳时",
  "11:00 - 12:59 午时",
  "13:00 - 14:59 未时",
  "15:00 - 16:59 申时",
  "17:00 - 18:59 酉时",
  "19:00 - 20:59 戌时",
  "21:00 - 22:59 亥时",
  "23:00 - 23:59 晚子"
];

/// 天干：甲、乙、丙、丁、戊、己、庚、辛、壬、癸
/// 注：天干地支的最后一位，取余为0，所以将天干地支中最后一位提到数组首位
const List<String> c_day_stem = [
  "癸",
  "甲",
  "乙",
  "丙",
  "丁",
  "戊",
  "己",
  "庚",
  "辛",
  "壬",
];

/// 地支
const List<String> c_earth_branch = [
  "亥",
  "子",
  "丑",
  "寅",
  "卯",
  "辰",
  "巳",
  "午",
  "未",
  "申",
  "酉",
  "戌",
];

/// 生肖
const List<String> c_zodiacs = [
  "鼠",
  "牛",
  "虎",
  "兔",
  "龙",
  "蛇",
  "马",
  "羊",
  "猴",
  "鸡",
  "狗",
  "猪"
];

/// 大师服务项目
const List<String> c_service = [
  "性格命运分析",
  "事业",
  "婚姻",
  "财运",
  "健康",
  "手相",
  "面相",
  "摸骨",
  "起名",
  "婚丧嫁娶吉日",
  "合婚",
];
