// ------------------------------------------------------
// author：suxing
// date  ：2020/8/6 10:30
// usage ：固定 int 类型数字
// ------------------------------------------------------

// ------------------------- 性别 ------------------------
const int male = 1; // 男性
const int female = 2; // 女性

// ------------------------- 六爻 ------------------------
const int shao_yin = 0; // 少阴 2背1字 3/8 概率
const int shao_yang = 1; // 少阳 1背2字 3/8 概率
const int lao_yin = 2; // 老阴 3字 1/8 概率
const int lao_yang = 3; // 老阳 3面 1/8 概率
