// ------------------------------------------------------
// author：suxing
// date  ：2020/9/24 16:08
// usage ：临时模拟回复数据
// ------------------------------------------------------

var replyJson = {
  "reply": [
    {
      "create_date": "2020-09-10 15:09:42",
      "icon": "",
      "is_master": true,
      "nick": "乾元明境",
      "text": [
        "第一条评论：中秋节起源于上古时代，普及于汉代，定型于唐朝初年，盛行于宋朝以后。"
            "中秋节是秋季时令习俗的综合，其所包含的节俗因素，大都有古老的渊源。"
            "秋节以月之圆兆人之团圆，为寄托思念故乡，思念亲人之情，"
            "祈盼丰收、幸福，成为丰富多彩、弥足珍贵的文化遗产。"
      ],
      "uid": 134
    },
    {
      "create_date": "2020-09-11 15:09:42",
      "icon": "",
      "is_master": false,
      "nick": "苏醒七号",
      "text": ["大师，我想再问下我和某某某合适吗"],
      "uid": 149
    },
    {
      "create_date": "2020-09-12 15:09:42",
      "icon": "",
      "is_master": true,
      "nick": "乾元明境",
      "text": [
        "我掐指一算，你们是可以的，下面说点废话，也有历史学家研究指出，"
            "中秋节起源应为隋末唐军于大业十三年八月十五日，唐军裴寂以圆月作为构思，"
            "成功发明月饼，并广发军中作为军饷，成功解决因大量吸收反隋义军而衍生之军粮问题。"
      ],
      "uid": 134
    },
    {
      "create_date": "2020-09-13 15:09:42",
      "icon": "",
      "is_master": false,
      "nick": "苏醒七号",
      "text": ["好的，谢谢大师，五星好评"],
      "uid": 149
    },
  ]
};
